# Streamlit 시각화
- 안산관내 학교 현황 시각화

## 221102
- 웨페이지 크롤링 및 데이터 csv파일 저장

In [77]:
import os
import pandas as pd
import lxml
import plotly.express as px
import streamlit as st
import matplotlib.pyplot as plt

def read_html():
	URL  = 'https://www.goeas.kr/USR/ORG/MNU13/SchoolList.do?orgType=Z'
	df = pd.read_html(URL, header=1)[0]
	df = df[:5]   # '계' 열 삭제
 
	# 공립, 사립 칼럼의 '-' 없애기
	def remove_str(col):
		return col.strip().replace("-","0")

	df['국립'] = df['국립'].apply(remove_str)
	df['공립'] = df['공립'].apply(remove_str)
	df['사립'] = df['사립'].apply(remove_str)
 
	# 공립, 사립 칼럼 숫자로 바꾸기
	# df_spc['가점_기타'] = df_spc['가점_기타'].astype(str)
	df['국립'] = df['국립'].astype(int)
	df['공립'] = df['공립'].astype(int)
	df['사립'] = df['사립'].astype(int)
	return df 

read_html()

     구분   계  국립  공립  사립    학생수   교원수
0   유치원  85   0  43  42   6778   549
1  초등학교  55   0  55   0  32223  1823
2   중학교  30   0  29   1  17882  1252
3  고등학교  24   0  15   9  19407  1759
4  특수학교   2   1   0   1    285   101

In [84]:
import datetime

DATE = datetime.datetime.now().strftime ("%Y%m%d")
df = read_html()
df.to_csv(f'data/{DATE}.csv')

## 221030
- 기초코드 작성

In [15]:
import pandas as pd
import lxml

In [71]:
URL  = 'https://www.goeas.kr/USR/ORG/MNU13/SchoolList.do?orgType=Z'
df = pd.read_html(URL, header=1)[0]
df = df[:5]   # '계' 열 삭제
df

     구분   계 국립  공립  사립    학생수   교원수
0   유치원  85  -  43  42   6778   549
1  초등학교  55  -  55   -  32223  1823
2   중학교  30  -  29   1  17882  1252
3  고등학교  24  -  15   9  19407  1759
4  특수학교   2  1   -   1    285   101

In [40]:
x_school = df['구분']

0    85
1    55
2    30
3    24
4     2
Name: 계, dtype: int64

In [42]:
df[['구분','공립','사립']]

     구분  공립  사립
0   유치원  43  42
1  초등학교  55   -
2   중학교  29   1
3  고등학교  15   9
4  특수학교   -   1

In [43]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   구분      5 non-null      object
 1   계       5 non-null      int64
 2   국립      5 non-null      object
 3   공립      5 non-null      object
 4   사립      5 non-null      object
 5   학생수     5 non-null      int64
 6   교원수     5 non-null      int64
dtypes: int64(3), object(4)
memory usage: 408.0+ bytes

In [72]:
# 공립, 사립 칼럼의 '-' 없애기
def remove_str(col):
    return col.strip().replace("-","0")

df['국립'] = df['국립'].apply(remove_str)
df['공립'] = df['공립'].apply(remove_str)
df['사립'] = df['사립'].apply(remove_str)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   구분      5 non-null      object
 1   계       5 non-null      int64
 2   국립      5 non-null      object
 3   공립      5 non-null      object
 4   사립      5 non-null      object
 5   학생수     5 non-null      int64
 6   교원수     5 non-null      int64
dtypes: int64(3), object(4)
memory usage: 408.0+ bytes

In [74]:
df

     구분   계 국립  공립  사립    학생수   교원수
0   유치원  85  0  43  42   6778   549
1  초등학교  55  0  55   0  32223  1823
2   중학교  30  0  29   1  17882  1252
3  고등학교  24  0  15   9  19407  1759
4  특수학교   2  1   0   1    285   101

In [75]:
# 공립, 사립 칼럼 숫자로 바꾸기
# df_spc['가점_기타'] = df_spc['가점_기타'].astype(str)
df['국립'] = df['국립'].astype(int)
df['공립'] = df['공립'].astype(int)
df['사립'] = df['사립'].astype(int)
df

     구분   계  국립  공립  사립    학생수   교원수
0   유치원  85   0  43  42   6778   549
1  초등학교  55   0  55   0  32223  1823
2   중학교  30   0  29   1  17882  1252
3  고등학교  24   0  15   9  19407  1759
4  특수학교   2   1   0   1    285   101

In [76]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   구분      5 non-null      object
 1   계       5 non-null      int64
 2   국립      5 non-null      int64
 3   공립      5 non-null      int64
 4   사립      5 non-null      int64
 5   학생수     5 non-null      int64
 6   교원수     5 non-null      int64
dtypes: int64(6), object(1)
memory usage: 408.0+ bytes